ＤＭＺ（非武装地帯）、は社外の人から(インターネットから）勝手に機密情報を持っている社内サーバであるＡＰサーバＤＢサーバにアクセスさせないようにＤＭＺはクライアントからリクエストを受け、レスポンスを返す役割をしている。

非機能要件　画面を押すと、画面遷移するといった必要なシステムの機能以外のこと。セキュリティや可用性

機能要件　非機能要件以外

２進か１０進(BCD)

２進数を人間に分かりやすく示したもの

189=0001 1000 1001

パック１０進数

BCDで定義された１０進数

１０進数が偶数桁の場合一番前に 0000つける

また、正の整数は一番左に[1100]負の整数は[1101]つける

1234 0000 0001 0010 0011 0100 1100 整数バイトで表せるようにする



単精度浮動小数点　符号部1bit 指数部8bit  仮数部23bit(32bit

倍精度浮動小数点   符号部1bit 指数部11bit 仮数部52bit(その名の通りこっちのほうがあらわせる数の範囲広い64bit

５P２＝異なる５つの中から２つ選び組み合わせる（順番は関係ないのでa-b,b-aで２通り）

C=並べるだけなので、逆は数えない（a-bのみ、b-aはかぞえない）

事象Aが起こった条件下で事象Bが起こる確率(B|A)

P(B|A)=P(AかつB）/P(A)

ベイズの理論

P(A|B)=P(AかつB）/P(B)＝P(B|A)＊P(A)/P(B)